
# Напишите функцию группового переименования файлов. 
#Она должна:
#  - принимать параметр желаемое конечное имя файлов. 
#  - При переименовании в конце имени добавляется порядковый номер.
#  - принимать параметр количество цифр в порядковом номере?????.
#  - принимать параметр расширение исходного файла. 
#  - Переименование должно работать только для этих файлов внутри каталога.
#  - принимать параметр расширение конечного файла.
#  - принимать диапазон сохраняемого оригинального имени. 
# Например для диапазона [3, 6] берутся буквы с 3 по 6 из исходного имени файла. name = temp.txt
# К ним прибавляется желаемое конечное имя, если оно передано. 
# Далее счётчик файлов и расширение. tem_items_num.pdf

#Соберите из созданных на уроке и в рамках домашнего задания 
# функций пакет для работы с файлами.
import random
import os
import sys

# def make_rand_file(num:int): # количество раз создания файлов
#     extension = ["txt","png","jpg","pdf"]
#     for i in range(num):
#         print(random.choice(extension))








