# Напишите функцию для транспонирования матрицы

import numpy as np

array_matr = np.array([[1,2,3,4],[6,5,4,3]])
arr_transport = array_matr.transpose()

print(arr_transport)